* %^{TYPE} 5/3/1 Session
:PROPERTIES:
:DATE:  %<%Y-%m-%d>
:CYCLE: %^{CYCLE}
:WEEK:  %^{WEEK|1|2|3}
:TYPE:  %1
:END:

# Insert the Snapshot Maxes Table dynamically
%(my/get-snapshot-maxes)

#+NAME: %<%Y-%m-%d>-warmup
| Component     | Time(s) | Set | Reps | Note       |
|---------------+---------+-----+------+------------|
| Elephant Walk |         |   1 |    5 |            |
| Toe Touch     |      30 |   1 |      |            |
| Hip Flexor    |      30 |   1 |      | Right side |
|               |      30 |   2 |      | Left side  |
| Pancake       |      30 |   1 |      |            |
| Figure 4      |      30 |   1 |      | Right side |
|               |      30 |   2 |      | Left side  |
| Lat Stretch   |      30 |   1 |      |            |
| Side Stretch  |      30 |   1 |      | Right side |
|               |      30 |   2 |      | Left side  |

#+NAME: %<%Y-%m-%d>-lift
| Component | Set | Reps | Weight | Note |
|-----------+-----+------+--------+------|
| %1        |   1 |      |        |      |
|           |   2 |      |        |      |
|           |   3 |      |        |      |
#+TBLFM: $4=if("$PROP_TYPE"=="bench", round(remote(%<%Y-%m-%d>-maxes,@2$2) * (if($PROP_WEEK=1, if(@#=2,0.65, if(@#=3,0.75,0.85)), if($PROP_WEEK=2, if(@#=2,0.70, if(@#=3,0.80,0.90)), if($PROP_WEEK=3, if(@#=2,0.75, if(@#=3,0.85,0.95)), 1))))/5)*5, if("$PROP_TYPE"=="squat",    round(remote(%<%Y-%m-%d>-maxes,@3$2) * (if($PROP_WEEK=1, if(@#=2,0.65, if(@#=3,0.75,0.85)), if($PROP_WEEK=2, if(@#=2,0.70, if(@#=3,0.80,0.90)), if($PROP_WEEK=3, if(@#=2,0.75, if(@#=3,0.85,0.95)), 1))))/5)*5, if("$PROP_TYPE"=="deadlift", round(remote(%<%Y-%m-%d>-maxes,@4$2) * (if($PROP_WEEK=1, if(@#=2,0.65, if(@#=3,0.75,0.85)), if($PROP_WEEK=2, if(@#=2,0.70, if(@#=3,0.80,0.90)), if($PROP_WEEK=3, if(@#=2,0.75, if(@#=3,0.85,0.95)), 1))))/5)*5, if("$PROP_TYPE"=="press", round(remote(%<%Y-%m-%d>-maxes,@5$2) * (if($PROP_WEEK=1, if(@#=2,0.65, if(@#=3,0.75,0.85)), if($PROP_WEEK=2, if(@#=2,0.70, if(@#=3,0.80,0.90)), if($PROP_WEEK=3, if(@#=2,0.75, if(@#=3,0.85,0.95)), 1))))/5)*5, ""))))::$3=if($PROP_WEEK=1,5,if($PROP_WEEK=2,3,if($PROP_WEEK=3,if($2=1,5,if($2=2,3,1)),"")))

#+NAME: %<%Y-%m-%d>-accessories
| Component   | Sets | Reps | Weight | Note |
|-------------+------+------+--------+------|
| Split Squat |    5 |   10 |      0 |      |
| Dip         |    5 |    4 |      0 |      |
| Lat Raise   |    5 |   10 |     10 |      |
| Leg Raise   |    5 |   10 |      0 |      |

#+NAME: %<%Y-%m-%d>-conditioning
| Component | Time(min) | Heart Rate(avg.) | Power(watts avg.) | Note |
|-----------+-----------+------------------+-------------------+------|
| Bike      |           |                  |                   |      |
